[{"originalSentence":"This chapter seems to be like Solomon’s proverbs, a collection of wise sayings and observations, rather than a part of his sermon; but the preacher studied to be sententious, and “set in order many proverbs,” to be brought in in his preaching.","difficulty":6},{"originalSentence":"Yet the general scope of all the observations in this chapter is to recommend wisdom to us, and its precepts and rules, as of great use for the right ordering of our conversation and to caution us against folly.","difficulty":36},{"originalSentence":"I.","difficulty":50},{"originalSentence":"He recommends wisdom to private persons, who are in an inferior station.","difficulty":41},{"originalSentence":"1.","difficulty":56},{"originalSentence":"It is our wisdom to preserve our reputation, in managing our affairs dexterously, Eccl.","difficulty":98},{"originalSentence":"10:1-3.","difficulty":21},{"originalSentence":"2.","difficulty":10},{"originalSentence":"To be submissive to our superiors if at any time we have offended them, Eccl.","difficulty":38},{"originalSentence":"10:4.","difficulty":26},{"originalSentence":"3.","difficulty":81},{"originalSentence":"To live quiet and peaceable lives, and not to meddle with those that are factious and seditious, and are endeavouring to disturb the government and the public repose, the folly and danger of which disloyal and turbulent practices he shows, Eccl.","difficulty":7},{"originalSentence":"10:8-11.","difficulty":49},{"originalSentence":"4.","difficulty":77},{"originalSentence":"To govern our tongues well, Eccl.","difficulty":87},{"originalSentence":"10:12-15.","difficulty":77},{"originalSentence":"5.","difficulty":35},{"originalSentence":"To be diligent in our business and provide well for our families, Eccl.","difficulty":23},{"originalSentence":"10:18-19.","difficulty":92},{"originalSentence":"6.","difficulty":85},{"originalSentence":"Not to speak ill of our rulers, no, not in secret, Eccl.","difficulty":72},{"originalSentence":"10:20.","difficulty":52},{"originalSentence":"II.","difficulty":74},{"originalSentence":"He recommends wisdom to rulers; let them not think that, because their subjects must be quiet under them, therefore they may do what they please; no, but, 1.","difficulty":14},{"originalSentence":"Let them be careful whom they prefer to places of trust and power, Eccl.","difficulty":87},{"originalSentence":"10:5-7.","difficulty":64},{"originalSentence":"2.","difficulty":5},{"originalSentence":"Let them manage themselves discreetly, be generous and not childish, temperate and not luxurious, Eccl.","difficulty":47},{"originalSentence":"10:16, 17.","difficulty":39},{"originalSentence":"Happy the nation when princes and people make conscience of their duty according to these rules.","difficulty":80}]