[{"originalSentence":"Here is, I.","difficulty":87},{"originalSentence":"An account of the penman of this book; it was Solomon, for no other son of David was king of Jerusalem; but he conceals his name Solomon, peaceable, because by his sin he had brought trouble upon himself and his kingdom, had broken his peace with God and lost the peace of his conscience, and therefore was no more worthy of that name.","difficulty":67},{"originalSentence":"Call me not Solomon, call me Marah, for, behold, for peace I had great bitterness.","difficulty":13},{"originalSentence":"But he calls himself,\n\n1.","difficulty":52},{"originalSentence":"The preacher, which intimates his present character.","difficulty":96},{"originalSentence":"He is Koheleth, which comes from a word which signifies to gather; but it is of a feminine termination, by which perhaps Solomon intends to upbraid himself with his effeminacy, which contributed more than any thing to his apostasy; for it was to please his wives that he set up idols, Neh.","difficulty":65},{"originalSentence":"13:26.","difficulty":15},{"originalSentence":"Or the word soul must be understood, and so Koheleth is,\n\n(1.","difficulty":49},{"originalSentence":") A penitent soul, or one gathered, one that had rambled and gone astray like a lost sheep, but was now reduced, gathered in from his wanderings, gathered home to his duty, and come at length to himself.","difficulty":19},{"originalSentence":"The spirit that was dissipated after a thousand vanities is now collected and made to centre in God.","difficulty":89},{"originalSentence":"Divine grace can make great sinners great converts, and renew even those to repentance who, after they had known the way of righteousness, turned aside from it, and heal their backslidings, though it is a difficult case.","difficulty":39},{"originalSentence":"It is only the penitent soul that God will accept, the heart that is broken, not the head that is bowed down like a bulrush only for a day, David’s repentance, not Ahab’s.","difficulty":43},{"originalSentence":"And it is only the gathered soul that is the penitent soul, that comes back from its by-paths, that no longer scatters its way to the strangers (Jer.","difficulty":100},{"originalSentence":"3:13), but is united to fear God’s name.","difficulty":42},{"originalSentence":"Out of the abundance of the heart the mouth will speak, and therefore we have here the words of the penitent, and those published.","difficulty":89},{"originalSentence":"If eminent professors of religion fall into gross sin, they are concerned, for the honour of God and the repairing of the damage they have done to his kingdom, openly to testify their repentance, that the antidote may be administered as extensively as the poison.","difficulty":1},{"originalSentence":"(2.","difficulty":74},{"originalSentence":") A preaching soul, or one gathering.","difficulty":74},{"originalSentence":"Being himself gathered to the congregation of saints, out of which he had by his sin thrown himself, and being reconciled to the church, he endeavours to gather others to it that had gone astray like him, and perhaps were led astray by his example.","difficulty":22},{"originalSentence":"He that has done any thing to seduce his brother ought to do all he can to restore him.","difficulty":63},{"originalSentence":"Perhaps Solomon called together a congregation of his people, as he had done at the dedication of the temple (1 Kgs.","difficulty":4},{"originalSentence":"8:2), so now at the rededicating of himself.","difficulty":87},{"originalSentence":"In that assembly he presided as the people’s mouth to God in prayer (Eccl.","difficulty":73},{"originalSentence":"1:12); in this as God’s mouth to them in preaching.","difficulty":30},{"originalSentence":"God by his Spirit made him a preacher, in token of his being reconciled to him; a commission is a tacit pardon.","difficulty":49},{"originalSentence":"Christ sufficiently testifies his forgiving Peter by committing his lambs and sheep to his trust.","difficulty":66},{"originalSentence":"Observe, Penitents should be preachers; those that have taken warning themselves to turn and live should give warning to others not to go on and die.","difficulty":35},{"originalSentence":"When thou art converted strengthen thy brethren.","difficulty":51},{"originalSentence":"Preachers must be preaching souls, for that only is likely to reach to the heart that comes from the heart.","difficulty":3},{"originalSentence":"Paul served God with his spirit in the gospel of his Son, Rom.","difficulty":98},{"originalSentence":"1:9.","difficulty":70},{"originalSentence":"2.","difficulty":98},{"originalSentence":"The son of David.","difficulty":38},{"originalSentence":"His taking this title intimates, (1.","difficulty":23},{"originalSentence":") That he looked upon it as a great honour to be the son of so good a man, and valued himself very much upon it.","difficulty":44},{"originalSentence":"(2.","difficulty":29},{"originalSentence":") That he also looked upon it as a great aggravation of his sin that he had such a father, who had given him a good education and put up many a good prayer for him; it cuts him to the heart to think that he should be a blemish and disgrace to the name and family of such a one as David.","difficulty":68},{"originalSentence":"It aggravated the sin of Jehoiakim that he was the son of Josiah, Jer.","difficulty":73},{"originalSentence":"22:15-17.","difficulty":74},{"originalSentence":"(3.","difficulty":98},{"originalSentence":") That his being the son of David encouraged him to repent and hope for mercy, for David had fallen into sin, by which he should have been warned not to sin, but was not; but David repented, and therein he took example from him and found mercy as he did.","difficulty":18},{"originalSentence":"Yet this was not all; he was that son of David concerning whom God had said that though he would chasten his transgression with the rod, yet he would not break his covenant with him, Ps.","difficulty":30},{"originalSentence":"89:34.","difficulty":38},{"originalSentence":"Christ, the great preacher, was the Son of David.","difficulty":40},{"originalSentence":"3.","difficulty":30},{"originalSentence":"King of Jerusalem.","difficulty":89},{"originalSentence":"This he mentions, (1.","difficulty":12},{"originalSentence":") As that which was a very great aggravation of his sin.","difficulty":22},{"originalSentence":"He was a king.","difficulty":10},{"originalSentence":"God had done much for him, in raising him to the throne, and yet he had so ill requited him; his dignity made the bad example and influence of his sin the more dangerous, and many would follow his pernicious ways; especially as he was king of Jerusalem, the holy city, where God’s temple was, and of his own building too, where the priests, the Lord’s ministers, were, and his prophets who had taught him better things.","difficulty":73},{"originalSentence":"(2.","difficulty":67},{"originalSentence":") As that which might give some advantage to what he wrote, for where the word of a king is there is power.","difficulty":2},{"originalSentence":"He thought it no disparagement to him, as a king, to be a preacher; but the people would regard him the more as a preacher because he was a king.","difficulty":82},{"originalSentence":"If men of honour would lay out themselves to do good, what a great deal of good might they do!","difficulty":38},{"originalSentence":"Solomon looked as great in the pulpit, preaching the vanity of the world, as in his throne of ivory, judging.","difficulty":41},{"originalSentence":"The Chaldee-paraphrase (which, in this book, makes very large additions to the text, or comments upon it, all along) gives this account of Solomon’s writing this book, That by the spirit of prophecy he foresaw the revolt of the ten tribes from his son, and, in process of time, the destruction of Jerusalem and the house of the sanctuary, and the captivity of the people, in the foresight of which he said, Vanity of vanities, all is vanity; and to that he applies many passages in this book.","difficulty":23},{"originalSentence":"II.","difficulty":97},{"originalSentence":"The general scope and design of the book.","difficulty":2},{"originalSentence":"What is it that this royal preacher has to say?","difficulty":65},{"originalSentence":"That which he aims at is, for the making of us truly religious, to take down our esteem of and expectation from the things of this world.","difficulty":24},{"originalSentence":"In order to this, he shows,\n\n1.","difficulty":23},{"originalSentence":"That they are all vanity, Eccl.","difficulty":91},{"originalSentence":"1:2.","difficulty":81},{"originalSentence":"This is the proposition he lays down and undertakes to prove: Vanity of vanities, all is vanity.","difficulty":49},{"originalSentence":"It was no new text; his father David had more than once spoken to the same purport.","difficulty":32},{"originalSentence":"The truth itself here asserted is, that all is vanity, all besides God and considered as abstract from him, the all of this world, all worldly employments and enjoyments, the all that is in the world (1 John 2:16), all that which is agreeable to our senses and to our fancies in this present state, which gains pleasure to ourselves or reputation with others.","difficulty":78},{"originalSentence":"It is all vanity, not only in the abuse of it, when it is perverted by the sin of man, but even in the use of it.","difficulty":93},{"originalSentence":"Man, considered with reference to these things, is vanity (Ps.","difficulty":56},{"originalSentence":"39:5, 6), and, if there were not another life after this, were made in vain (Ps.","difficulty":66},{"originalSentence":"89:47); and those things, considered in reference to man (whatever they are in themselves), are vanity.","difficulty":25},{"originalSentence":"They are impertinent to the soul, foreign, and add nothing to it; they do not answer the end, nor yield any true satisfaction; they are uncertain in their continuance, are fading, and perishing, and passing away, and will certainly deceive and disappoint those that put a confidence in them.","difficulty":51},{"originalSentence":"Let us not therefore love vanity (Ps.","difficulty":53},{"originalSentence":"4:2), nor lift up our souls to it (Ps.","difficulty":97},{"originalSentence":"24:4), for we shall but weary ourselves for it, Heb.","difficulty":5},{"originalSentence":"2:13.","difficulty":40},{"originalSentence":"It is expressed here very emphatically; not only, All is vain, but in the abstract, All is vanity; as if vanity were the proprium quarto modo—property in the fourth mode, of the things of this world, that which enters into the nature of them.","difficulty":91},{"originalSentence":"The are not only vanity, but vanity of vanities, the vainest vanity, vanity in the highest degree, nothing but vanity, such a vanity as is the cause of a great deal of vanity.","difficulty":56},{"originalSentence":"And this is redoubled, because the thing is certain and past dispute, it is vanity of vanities.","difficulty":49},{"originalSentence":"This intimates that the wise man had his own heart fully convinced of and much affected with this truth, and that he was very desirous that others should be convinced of it and affected with it, as he was, but that he found the generality of men very loth to believe it and consider it (Job 33:14); it intimates likewise that we cannot comprehend and express the vanity of this world.","difficulty":98},{"originalSentence":"But who is it that speaks thus slightly of the world?","difficulty":50},{"originalSentence":"Isa.","difficulty":82},{"originalSentence":"it one that will stand to what he says?","difficulty":37},{"originalSentence":"Yes, he puts his name to it—saith the preacher.","difficulty":31},{"originalSentence":"Isa.","difficulty":12},{"originalSentence":"it one that was a competent judge?","difficulty":81},{"originalSentence":"Yes, as much as ever any man was.","difficulty":91},{"originalSentence":"Many speak contemptuously of the world because they are hermits, and know it not, or beggars, and have it not; but Solomon knew it.","difficulty":2},{"originalSentence":"He had dived into nature’s depths (1 Kgs.","difficulty":24},{"originalSentence":"4:33), and he had it, more of it perhaps than ever any man had, his head filled with its notions and his belly with its hidden treasures (Ps.","difficulty":16},{"originalSentence":"17:14), and he passes this judgment on it.","difficulty":28},{"originalSentence":"But did he speak as one having authority?","difficulty":14},{"originalSentence":"Yes, not only that of a king, but that of a prophet, a preacher; he spoke in God’s name, and was divinely inspired to say it.","difficulty":15},{"originalSentence":"But did he not say it in his haste, or in a passion, upon occasion of some particular disappointment?","difficulty":61},{"originalSentence":"No; he said it deliberately, said it and proved it, laid it down as a fundamental principle, on which he grounded the necessity of being religious.","difficulty":62},{"originalSentence":"And, as some think, one main thing he designed was to show that the everlasting throne and kingdom which God had by Nathan promised to David and his seed must be of another world; for all things in this world are subject to vanity, and therefore have not in them sufficient to answer the extent of that promise.","difficulty":71},{"originalSentence":"If Solomon find all to be vanity, then the kingdom of the Messiah must come, in which we shall inherit substance.","difficulty":4},{"originalSentence":"2.","difficulty":84},{"originalSentence":"That they are insufficient to make us happy.","difficulty":54},{"originalSentence":"And for this he appeals to men’s consciences: What profit has a man of all the pains he takes?","difficulty":17},{"originalSentence":"Eccl.","difficulty":77},{"originalSentence":"1:3.","difficulty":7},{"originalSentence":"Observe here, (1.","difficulty":64},{"originalSentence":") The business of this world described.","difficulty":49},{"originalSentence":"It is labour; the word signifies both care and toil.","difficulty":28},{"originalSentence":"It is work that wearies men.","difficulty":3},{"originalSentence":"There is a constant fatigue in worldly business.","difficulty":24},{"originalSentence":"It is labour under the sun; that is a phrase peculiar to this book, where we meet with it twenty-eight times.","difficulty":7},{"originalSentence":"There is a world above the sun, a world which needs not the sun, for the glory of God is its light, where there is work without labour and with great profit, the work of angels; but he speaks of the work under the sun, the pains of which are great and the gains little.","difficulty":8},{"originalSentence":"It is under the sun, under the influence of the sun, by its light and in its heat; as we have the benefit of the light of the day, so we have sometimes the burden and heat of the day (Matt.","difficulty":72},{"originalSentence":"20:12), and therefore in the sweat of our face we eat bread.","difficulty":36},{"originalSentence":"In the dark and cold grave the weary are at rest.","difficulty":75},{"originalSentence":"(2.","difficulty":10},{"originalSentence":") The benefit of that business enquired into: What profit has a man of all that labour?","difficulty":94},{"originalSentence":"Solomon says (Prov.","difficulty":16},{"originalSentence":"14:23), In all labour there is profit; and yet here he denies that there is any profit.","difficulty":77},{"originalSentence":"As to our present condition in the world, it is true that by labour we get that which we call profit; we eat the labour of our hands; but as the wealth of the world is commonly called substance, and yet it is that which is not (Prov.","difficulty":62},{"originalSentence":"22:5), so it is called profit, but the question is whether it be really so or no.","difficulty":93},{"originalSentence":"And here he determines that it is not, that it is not a real benefit, that it is not a remaining benefit.","difficulty":14},{"originalSentence":"In short, the wealth and pleasure of this world, if we had ever so much of them, are not sufficient to make us happy, nor will they be a portion for us.","difficulty":99},{"originalSentence":"[1.","difficulty":100},{"originalSentence":"] As to the body, and the life that now is, What profit has a man of all his labour?","difficulty":48},{"originalSentence":"A man’s life consists not in an abundance, Luke 12:15.","difficulty":7},{"originalSentence":"As goods are increased care about them is increased, and those are increased that eat of them, and a little thing will embitter all the comfort of them; and then what profit has a man of all his labour?","difficulty":47},{"originalSentence":"Early up, and never the nearer.","difficulty":72},{"originalSentence":"[2.","difficulty":41},{"originalSentence":"] As to the soul, and the life that is to come, we may much more truly say, What profit has a man of all his labour?","difficulty":59},{"originalSentence":"All he gets by it will not supply the wants of the soul, nor satisfy its desires, will not atone for the sin of the soul, nor cure its diseases, nor contervail the loss of it; what profit will they be of to the soul in death, in judgment, or in the everlasting state?","difficulty":40},{"originalSentence":"The fruit of our labour in heavenly things is meat that endures to eternal life, but the fruit of our labour for the world is only meat that perishes.","difficulty":79}]