[{"originalSentence":"Solomon, having asserted in general that all is vanity, and having given some general proofs of it, now takes the most effectual method to evince the truth of it, 1.","difficulty":57},{"originalSentence":"By his own experience; he tried them all, and found them vanity.","difficulty":9},{"originalSentence":"2.","difficulty":68},{"originalSentence":"By an induction of particulars; and here he begins with that which bids fairest of all to be the happiness of a reasonable creature, and that is knowledge and learning; if this be vanity, every thing else must needs be so.","difficulty":86},{"originalSentence":"Now as to this,\n\nI.","difficulty":43},{"originalSentence":"Solomon tells us here what trial he had made of it, and that with such advantages that, if true satisfaction could have been found in it, he would have found it.","difficulty":67},{"originalSentence":"1.","difficulty":41},{"originalSentence":"His high station gave him an opportunity of improving himself in all parts of learning, and particularly in politics and the conduct of human affairs, Eccl.","difficulty":70},{"originalSentence":"1:12.","difficulty":95},{"originalSentence":"He that is the preacher of this doctrine was king over Israel, whom all their neighbours admired as a wise and understanding people, Deut.","difficulty":50},{"originalSentence":"4:6.","difficulty":87},{"originalSentence":"He had his royal seat in Jerusalem, which then deserved, better than Athens ever did, to be called the eye of the world.","difficulty":46},{"originalSentence":"The heart of a king is unsearchable; he has reaches of his own, and a divine sentence is often in his lips.","difficulty":80},{"originalSentence":"It is his honour, it is his business, to search out every matter.","difficulty":66},{"originalSentence":"Solomon’s great wealth and honour put him into a capacity of making his court the centre of learning and the rendezvous of learned men, of furnishing himself with the best of books, and either conversing or corresponding with all the wise and knowing part of mankind then in being, who made application to him to learn of him, by which he could not but improve himself; for it is in knowledge as it is in trade, all the profit is by barter and exchange; if we have that to say which will instruct others, they will have that to say which will instruct us.","difficulty":41},{"originalSentence":"Some observe how slightly Solomon speaks of his dignity and honour.","difficulty":38},{"originalSentence":"He does not say, I the preacher am king, but I was king, no matter what I am.","difficulty":61},{"originalSentence":"He speaks of it as a thing past, because worldly honours are transitory.","difficulty":70},{"originalSentence":"2.","difficulty":59},{"originalSentence":"He applied himself to the improvement of these advantages, and the opportunities he had of getting wisdom, which, though ever so great, will not make a man wise unless he give his mind to it.","difficulty":74},{"originalSentence":"Solomon gave his heart to seek and search out all things to be known by wisdom, Eccl.","difficulty":12},{"originalSentence":"1:13.","difficulty":95},{"originalSentence":"He made it his business to acquaint himself with all the things that are done under the sun, that are done by the providence of God or by the art and prudence of man.","difficulty":75},{"originalSentence":"He set himself to get all the insight he could into philosophy and mathematics, into husbandry and trade, merchandise and mechanics, into the history of former ages and the present state of other kingdoms, their laws, customs, and policies, into men’s different tempers, capacities, and projects, and the methods of managing them; he set himself not only to seek, but to search, to pry into, that which is most intricate, and which requires the closes application of mind and the most vigorous and constant prosecution.","difficulty":43},{"originalSentence":"Though he was a prince, he made himself a drudge to learning, was not discouraged by its knots, nor took up short of its depths.","difficulty":76},{"originalSentence":"And this he did, not merely to gratify his own genius, but to qualify himself for the service of God, and his generation, and to make an experiment how far the enlargement of the knowledge would go towards the settlement and repose of the mind.","difficulty":64},{"originalSentence":"3.","difficulty":35},{"originalSentence":"He made a very great progress in his studies, wonderfully improved all the parts of learning, and carried his discoveries much further than any that had been before him.","difficulty":2},{"originalSentence":"He did not condemn learning, as many do, because they cannot conquer it and will not be at the pains to make themselves masters of it; no, what he aimed at he compassed; he saw all the works that were done under the sun (Eccl.","difficulty":17},{"originalSentence":"1:14), works of nature in the upper and lower world, all within this vortex (to use the modern gibberish) which has the sun for its centre, works of art, the product of men’s wit, in a personal or social capacity.","difficulty":71},{"originalSentence":"He had as much satisfaction in the success of his searches as ever any man had; he communed with his own heart concerning his attainments in knowledge, with as much pleasure as ever any rich merchant had in taking account of his stock.","difficulty":96},{"originalSentence":"He could say, “Lo, I have magnified and increased wisdom, have not only gotten more of it myself, but have done more to propagate it and bring it into reputation, than any, than all that have been before me in Jerusalem.","difficulty":27},{"originalSentence":"” Note, It becomes great men to be studious, and delight themselves most in intellectual pleasures.","difficulty":18},{"originalSentence":"Where God gives great advantages of getting knowledge he expects improvements accordingly.","difficulty":83},{"originalSentence":"It is happy with a people when their princes and noblemen study to excel others as much in wisdom and useful knowledge as they do in honour and estate; and they may do that service to the commonwealth of learning by applying themselves to the studies that are proper for them which meaner persons cannot do.","difficulty":35},{"originalSentence":"Solomon must be acknowledged as competent judge of this matter, for he had not only got his head full of notions, but his heart had great experience of wisdom and knowledge, of the power and benefit of knowledge, as well as the amusement and entertainment of it; what he knew he had digested, and knew how to make use of.","difficulty":82},{"originalSentence":"Wisdom entered into his heart, and so became pleasant to his soul, Prov.","difficulty":43},{"originalSentence":"2:10, 11; 22:18.","difficulty":43},{"originalSentence":"4.","difficulty":27},{"originalSentence":"He applied his studies especially to that part of learning which is most serviceable to the conduct of human life, and consequently is the most valuable (Eccl.","difficulty":89},{"originalSentence":"1:17): “I gave my heart to know the rules and dictates of wisdom, and how I might obtain it; and to know madness and folly, how I might prevent and cure it, to know the snares and insinuations of it, that I might avoid them, and guard against them, and discover its fallacies.","difficulty":65},{"originalSentence":"” So industrious was Solomon to improve himself in knowledge that he gained instruction both by the wisdom of prudent men and by the madness of foolish men, by the field of the slothful, as well as of the diligent.","difficulty":70},{"originalSentence":"II.","difficulty":49},{"originalSentence":"He tells us what was the result of this trial, to confirm what he had said, that all is vanity.","difficulty":2},{"originalSentence":"1.","difficulty":67},{"originalSentence":"He found that his searches after knowledge were very toilsome, and a weariness not only to the flesh, but to the mind (Eccl.","difficulty":99},{"originalSentence":"1:13): This sore travail, this difficulty that there is in searching after truth and finding it, God has given to the sons of men to be afflicted therewith, as a punishment for our first parents’ coveting forbidden knowledge.","difficulty":16},{"originalSentence":"As bread for the body, so that for the soul, must be got and eaten in the sweat of our face, whereas both would have been had with out labour if Adam had not sinned.","difficulty":98},{"originalSentence":"2.","difficulty":55},{"originalSentence":"He found that the more he saw of the works done under the sun the more he saw of their vanity; nay, and the sight often occasioned him vexation of spirit (Eccl.","difficulty":9},{"originalSentence":"1:14): “I have seen all the works of a world full of business, have observed what the children of men are doing; and behold, whatever men think of their own works, I see all is vanity and vexation of spirit.","difficulty":49},{"originalSentence":"” He had before pronounced all vanity (Eccl.","difficulty":72},{"originalSentence":"1:2), needless and unprofitable, and that which does us no good; here he adds, It is all vexation of spirit, troublesome and prejudicial, and that which does us hurt.","difficulty":53},{"originalSentence":"It is feeding upon wind; so some read it, Hos.","difficulty":77},{"originalSentence":"12:1.","difficulty":84},{"originalSentence":"(1.","difficulty":35},{"originalSentence":") The works themselves which we see done are vanity and vexation to those that are employed in them.","difficulty":24},{"originalSentence":"There is so much care in the contrivance of our worldly business, so much toil in the prosecution of it, and so much trouble in the disappointments we meet with in it, that we may well say, It is vexation of spirit.","difficulty":2},{"originalSentence":"(2.","difficulty":20},{"originalSentence":") The sight of them is vanity and vexation of spirit to the wise observer of them.","difficulty":27},{"originalSentence":"The more we see of the world the more we see to make us uneasy, and, with Heraclitus, to look upon all with weeping eyes.","difficulty":66},{"originalSentence":"Solomon especially perceived that the knowledge of wisdom and folly was vexation of spirit, Eccl.","difficulty":58},{"originalSentence":"1:17.","difficulty":73},{"originalSentence":"It vexed him to see many that had wisdom not use it, and many that had folly not strive against it.","difficulty":40},{"originalSentence":"It vexed him when he knew wisdom to see how far off it stood from the children of men, and, when he saw folly, to see how fast it was bound in their hearts.","difficulty":45},{"originalSentence":"3.","difficulty":22},{"originalSentence":"He found that when he had got some knowledge he could neither gain that satisfaction to himself nor do that good to others with it which he expected, Eccl.","difficulty":81},{"originalSentence":"1:15.","difficulty":77},{"originalSentence":"It would not avail, (1.","difficulty":9},{"originalSentence":") To redress the many grievances of human life: “After all, I find that that which is crooked will be crooked still and cannot be made straight.","difficulty":93},{"originalSentence":"” Our knowledge is itself intricate and perplexed; we must go far about and fetch a great compass to come at it.","difficulty":0},{"originalSentence":"Solomon thought to find out a nearer way to it, but he could not.","difficulty":58},{"originalSentence":"The paths of learning are as much a labyrinth as ever they were.","difficulty":1},{"originalSentence":"The minds and manners of men are crooked and perverse.","difficulty":36},{"originalSentence":"Solomon thought, with his wisdom and power together, thoroughly to reform his kingdom, and make that straight which he found crooked; but he was disappointed.","difficulty":34},{"originalSentence":"All the philosophy and politics in the world will not restore the corrupt nature of man to its primitive rectitude; we find the insufficiency of them both in others and in ourselves.","difficulty":99},{"originalSentence":"Learning will not alter men’s natural tempers, nor cure them of their sinful distempers; nor will it change the constitution of things in this world; a vale of tears it is and so it will be when all is done.","difficulty":8},{"originalSentence":"(2.","difficulty":46},{"originalSentence":") To make up the many deficiencies in the comfort of human life: That which is wanting there cannot be numbered, or counted out to us from the treasures of human learning, but what is wanting will still be so.","difficulty":3},{"originalSentence":"All our enjoyments here, when we have done our utmost to bring them to perfection, are still lame and defective, and it cannot be helped; as they are, so they are likely to be.","difficulty":29},{"originalSentence":"That which is wanting in our knowledge is so much that it cannot be numbered.","difficulty":20},{"originalSentence":"The more we know the more we see of our own ignorance.","difficulty":39},{"originalSentence":"Who can understand his errors, his defects?","difficulty":67},{"originalSentence":"4.","difficulty":47},{"originalSentence":"Upon the whole, therefore, he concluded that great scholars do but make themselves great mourners; for in much wisdom is much grief, Eccl.","difficulty":33},{"originalSentence":"1:18.","difficulty":10},{"originalSentence":"There must be a great deal of pains taken to get it, and a great deal of care not to forget it; the more we know the more we see there is to be known, and consequently we perceive with greater clearness that our work is without end, and the more we see of our former mistakes and blunders, which occasions much grief.","difficulty":94},{"originalSentence":"The more we see of men’s different sentiments and opinions (and it is that which a great deal of our learning is conversant about) the more at a loss we are, it may be, which is in the right.","difficulty":42},{"originalSentence":"Those that increase knowledge have so much the more quick and sensible perception of the calamities of this world, and for one discovery they make that is pleasing, perhaps, they make ten that are displeasing, and so they increase sorrow.","difficulty":31},{"originalSentence":"Let us not therefore be driven off from the pursuit of any useful knowledge, but put on patience to break through the sorrow of it; but let us despair of finding true happiness in this knowledge, and expect it only in the knowledge of God and the careful discharge of our duty to him.","difficulty":36},{"originalSentence":"He that increases in heavenly wisdom, and in an experimental acquaintance with the principles, powers, and pleasures of the spiritual and divine life, increases joy, such as will shortly be consummated in everlasting joy.","difficulty":3}]