[{"originalSentence":"To prove the vanity of all things under the sun, and their insufficiency to make us happy, Solomon here shows, 1.","difficulty":32},{"originalSentence":"That the time of our enjoyment of these things is very short, and only while we accomplish as a hireling his day.","difficulty":57},{"originalSentence":"We continue in the world but for one generation, which is continually passing away to make room for another, and we are passing with it.","difficulty":25},{"originalSentence":"Our worldly possessions we very lately had from others, and must very shortly leave to others, and therefore to us they are vanity; they can be no more substantial than that life which is the substratum of them, and that is but a vapour, which appears for a little while and then vanishes away.","difficulty":4},{"originalSentence":"While the stream of mankind is continually flowing, how little enjoyment has one drop of that stream of the pleasant banks between which it glides!","difficulty":84},{"originalSentence":"We may give God the glory of that constant succession of generations, in which the world has hitherto had its existence, and will have to the end of time, admitting his patience in continuing that sinful species and his power in continuing that dying species.","difficulty":45},{"originalSentence":"We may be also quickened to do the work of our generation diligently, and serve it faithfully, because it will be over shortly; and, in concern for mankind in general, we should consult the welfare of succeeding generations; but as to our own happiness, let us not expect it within such narrow limits, but in an eternal rest and consistency.","difficulty":0},{"originalSentence":"2.","difficulty":78},{"originalSentence":"That when we leave this world we leave the earth behind us, that abides for ever where it is, and therefore the things of the earth can stand us in no stead in the future state.","difficulty":43},{"originalSentence":"It is well for mankind in general that the earth endures to the end of time, when it and all the works in it shall be burnt up; but what is that to particular persons, when they remove to the world of spirits?","difficulty":83},{"originalSentence":"3.","difficulty":40},{"originalSentence":"That the condition of man is, in this respect, worse than that even of the inferior creatures: The earth abides for ever, but man abides upon the earth but a little while.","difficulty":76},{"originalSentence":"The sun sets indeed every night, yet it rises again in the morning, as bright and fresh as ever; the winds, though they shift their point, yet in some point or other still they are; the waters that go to the sea above ground come from it again under ground.","difficulty":100},{"originalSentence":"But man lies down and rises not, Job 14:7, 12.","difficulty":74},{"originalSentence":"4.","difficulty":76},{"originalSentence":"That all things in this world are movable and mutable, and subject to a continual toil and agitation, constant in nothing but inconstancy, still going, never resting; it was but once that the sun stood still; when it is risen it is hastening to set, and, when it is set, hastening to rise again (Eccl.","difficulty":86},{"originalSentence":"1:5); the winds are ever and anon shifting (Eccl.","difficulty":72},{"originalSentence":"1:6), and the waters in a continual circulation (Eccl.","difficulty":100},{"originalSentence":"1:7), it would be of as bad consequence for them to stagnate as for the blood in the body to do so.","difficulty":94},{"originalSentence":"And can we expect rest in a world where all things are thus full of labour (Eccl.","difficulty":55},{"originalSentence":"1:8), on a sea that is always ebbing and flowing, and her waves continually working and rolling?","difficulty":98},{"originalSentence":"5.","difficulty":92},{"originalSentence":"That though all things are still in motion, yet they are still where they were; The sun parts (as it is in the margin), but it is to the same place; the wind turns till it comes to the same place, and so the waters return to the place whence they came.","difficulty":53},{"originalSentence":"Thus man, after all the pains he takes to find satisfaction and happiness in the creature, is but where he was, still as far to seek as ever.","difficulty":43},{"originalSentence":"Man’s mind is as restless in its pursuits as the sun, and wind, and rivers, but never satisfied, never contented; the more it has of the world the more it would have; and it would be no sooner filled with the streams of outward prosperity, the brooks of honey and butter (Job 20:17), than the sea is with all the rivers that run into it; it is still as it was, a troubled sea that cannot rest.","difficulty":85},{"originalSentence":"6.","difficulty":12},{"originalSentence":"That all things continue as they were from the beginning of the creation, 2 Pet.","difficulty":83},{"originalSentence":"3:4.","difficulty":51},{"originalSentence":"The earth is where it was; the sun, and winds, and rivers, keep the same course that ever they did; and therefore, if they have never yet been sufficient to make a happiness for man, they are never likely to be so, for they can but yield the same comfort that they have yielded.","difficulty":42},{"originalSentence":"We must therefore look above the sun for satisfaction, and for a new world.","difficulty":21},{"originalSentence":"7.","difficulty":38},{"originalSentence":"That this world is, at the best, a weary land: All is vanity, for all is full of labour.","difficulty":22},{"originalSentence":"The whole creation is made subject to this vanity ever since man was sentenced to eat bread in the sweat of his brows.","difficulty":82},{"originalSentence":"If we survey the whole creation, we shall see all busy; all have enough to do to mind their own business; none will be a portion or happiness for man; all labour to serve him, but none prove a help-meet for him.","difficulty":75},{"originalSentence":"Man cannot express how full of labour all things are, can neither number the laborious nor measure the labours.","difficulty":76},{"originalSentence":"8.","difficulty":56},{"originalSentence":"That our senses are unsatisfied, and the objects of them unsatisfying.","difficulty":37},{"originalSentence":"He specifies those senses that perform their office with least toil, and are most capable of being pleased: The eye is not satisfied with seeing, but is weary of seeing always the same sight, and covets novelty and variety.","difficulty":14},{"originalSentence":"The ear is fond, at first, of a pleasant song or tune, but soon nauseates it, and must have another; both are surfeited, but neither satiated, and what was most grateful becomes ungrateful.","difficulty":21},{"originalSentence":"Curiosity is still inquisitive, because still unsatisfied, and the more it is humoured the more nice and peevish it grows, crying, Give, give.","difficulty":6}]