[{"originalSentence":"See here, 1.","difficulty":88},{"originalSentence":"How mischievous those are that make no scruple of deceiving their neighbours; they are as madmen that cast firebrands, arrows, and death, so much hurt may they do by their deceits.","difficulty":63},{"originalSentence":"They value themselves upon it as polite cunning men, but really they are as madmen.","difficulty":55},{"originalSentence":"There is not a greater madness in the world than a wilful sin.","difficulty":80},{"originalSentence":"It is not only the passionate furious man, but the malicious deceitful man, that is a madman; he does in effect cast fire-brands, arrows, and death; he does more mischief than he can imagine.","difficulty":8},{"originalSentence":"Fraud and falsehood burn like fire-brands, kill, even at a distance, like arrows.","difficulty":2},{"originalSentence":"2.","difficulty":29},{"originalSentence":"See how frivolous the excuse is which men commonly make for the mischief they do, that they did it in a jest; with this they think to turn it off when they are reproved for it, Amos not I in sport?","difficulty":22},{"originalSentence":"But it will prove dangerous playing with fire and jesting with edge-tools.","difficulty":21},{"originalSentence":"Not that those are to be commended who are captious, and can take no jest (those that themselves are wise must suffer fools, 2 Cor.","difficulty":17},{"originalSentence":"11:19, 20), but those are certainly to be condemned who are any way abusive to their neighbours, impose upon their credulity, cheat them in their bargains with them, tell lies to them or tell lies of them, give them ill language, or sully their reputation, and then think to excuse it by saying that they did but jest.","difficulty":33},{"originalSentence":"Amos not I in sport?","difficulty":25},{"originalSentence":"He that sins in just must repent in earnest, or his sin will be his ruin.","difficulty":36},{"originalSentence":"Truth is too valuable a thing to be sold for a jest, and so is the reputation of our neighbour.","difficulty":66},{"originalSentence":"By lying and slandering in jest men learn themselves, and teach others, to lie and slander in earnest; and a false report, raised in mirth, may be spread in malice; besides, if a man may tell a lie to make himself merry, why not to make himself rich, and so truth quite perishes, and men teach their tongues to tell lies, Jer.","difficulty":21},{"originalSentence":"9:5.","difficulty":93},{"originalSentence":"If men would consider that a lie comes from the devil, and brings to hell-fire, surely that would spoil the sport of it; it is casting arrows and death to themselves.","difficulty":80}]