[{"originalSentence":"The scope of these verses is to keep subjects loyal and dutiful to the government.","difficulty":18},{"originalSentence":"In Solomon’s reign the people were very rich, and lived in prosperity, which perhaps made them proud and petulant, and when the taxes were high, though they had enough to pay them with, it is probable that many conducted themselves insolently towards the government and threatened to rebel.","difficulty":10},{"originalSentence":"To such Solomon here gives some necessary cautions.","difficulty":30},{"originalSentence":"I.","difficulty":65},{"originalSentence":"Let not subjects carry on a quarrel with their prince upon any private personal disgust (Eccl.","difficulty":48},{"originalSentence":"10:4): “If the spirit of the ruler rise up against thee, if upon some misinformation given him, or some mismanagement of thine, he is displeased at thee, and threaten thee, yet leave not thy place, forget not the duty of a subject, revolt not from thy allegiance, do not, in a passion, quit thy post in his service and throw up thy commission, as despairing ever to regain his favour.","difficulty":33},{"originalSentence":"No, wait awhile, and thou wilt find he is not implacable, but that yielding pacifies great offences.","difficulty":12},{"originalSentence":"” Solomon speaks for himself, and for every wise and good man that is a master, or a magistrate, that he could easily forgive those, upon their submission, whom yet, upon their provocation, he had been very angry with.","difficulty":46},{"originalSentence":"It is safer and better to yield to an angry prince than to contend with him.","difficulty":41},{"originalSentence":"II.","difficulty":61},{"originalSentence":"Let not subjects commence a quarrel with their prince, though the public administration be not in every thing as they would have it.","difficulty":30},{"originalSentence":"He grants there is an evil often seen under the sun, and it is a king’s-evil, an evil which the king only can cure, for it is an error which proceeds from the ruler (Eccl.","difficulty":55},{"originalSentence":"10:5); it is a mistake which rulers, consulting their personal affections more than the public interests, are too often guilty of, that men are not preferred according to their merit, but folly is set in great dignity, men of shattered brains, and broken fortunes, are put in places of power and trust, while the rich men of good sense and good estates, whose interest would oblige them to be true to the public, and whose abundance would be likely to set them above temptations to bribery and extortion, yet sit in low places, and can get no preferment (Eccl.","difficulty":12},{"originalSentence":"10:6), either the ruler knows not how to value them or the terms of preferment are such as they cannot in conscience comply with.","difficulty":66},{"originalSentence":"It is ill with a people when vicious men are advanced and men of worth are kept under hatches.","difficulty":40},{"originalSentence":"This is illustrated Eccl.","difficulty":47},{"originalSentence":"10:7.","difficulty":22},{"originalSentence":"“I have seen servants upon horses, men not so much of mean extraction and education (if that were all, it were the more excusable, nay, there is many a wise servant who with good reason has rule over a son that causes shame), but of sordid, servile, mercenary dispositions.","difficulty":38},{"originalSentence":"I have seen these riding in pomp and state as princes, while princes, men of noble birth and qualities, fit to rule a kingdom, have been forced to walk as servants upon the earth, poor and despised.","difficulty":42},{"originalSentence":"” Thus God, in his providence, punishes a wicked people; but, as far as it is the ruler’s act and deed, it is certainly his error, and a great evil, a grievance to the subject and very provoking; but it is an error under the sun, which will certainly be rectified above the sun, and when it shall shine no more, for in heaven it is only wisdom and holiness that are set in great dignity.","difficulty":38},{"originalSentence":"But, if the prince be guilty of his error, yet let not the subjects leave their place, nor rise up against the government, nor form any project for the alteration of it; nor let the prince carry on the humour too far, nor set such servants, such beggars, on horseback, as will ride furiously over the ancient land-marks of the constitution, and threaten the subversion of it.","difficulty":29},{"originalSentence":"1.","difficulty":85},{"originalSentence":"Let neither prince nor people violently attempt any changes, nor make a forcible entry upon a national settlement, for they will both find it of dangerous consequence, which he shows here by four similitudes, the scope of which is to give us a caution not to meddle to our own hurt.","difficulty":26},{"originalSentence":"Let not princes invade the rights and liberties of their subjects; let not subjects mutiny and rebel against their princes; for, (1.","difficulty":3},{"originalSentence":") He that digs a pit for another, it is ten to one but he falls into it himself, and his violent dealing returns upon his own head.","difficulty":0},{"originalSentence":"If princes become tyrants, or subjects become rebels, all histories will tell both what is likely to be their fate and that it is at their utmost peril, and it were better for both to be content within their own bounds.","difficulty":69},{"originalSentence":"(2.","difficulty":17},{"originalSentence":") Whoso breaks a hedge, an old hedge, that has long been a land-mark, let him expect that a serpent, or adder, such as harbour in rotten hedges, will bite him; some viper or other will fasten upon his hand, Acts 28:3.","difficulty":30},{"originalSentence":"God, by his ordinance, as by a hedge, has inclosed the prerogatives and powers of princes; their persons are under his special protection; those therefore that form any treasonable designs against their peace, their crown, and dignity, are but twisting halters for themselves.","difficulty":27},{"originalSentence":"(3.","difficulty":73},{"originalSentence":") Whoso removes stones, to pull down a wall or building, does but pluck them upon himself; he shall be hurt therewith, and will wish that he had let them alone.","difficulty":98},{"originalSentence":"Those that go about to alter a well-modelled well-settled government, under colour of redressing some grievances and correcting some faults in it, will quickly perceive not only that it is easier to find fault than to mend, to demolish that which is good than to build up that which is better, but that they thrust their own fingers into the fire and overwhelm themselves in the ruin they occasion.","difficulty":14},{"originalSentence":"(4.","difficulty":82},{"originalSentence":") He that cleaves the wood, especially if, as it follows, he has sorry tools (Eccl.","difficulty":19},{"originalSentence":"10:10), shall be endangered thereby; the chips, or his own axe-head, will fly in his face.","difficulty":70},{"originalSentence":"If we meet with knotty pieces of timber, and we think to master them by force and violence, and hew them to pieces, they may not only prove too hard for us, but the attempt may turn to our own damage.","difficulty":23},{"originalSentence":"2.","difficulty":88},{"originalSentence":"Rather let both prince and people act towards each other with prudence, mildness, and good temper: Wisdom is profitable to direct the ruler how to manage a people that are inclined to be turbulent, so as neither, on the one hand, by a supine negligence to embolden and encourage them, nor, on the other hand, by rigour and severity to exasperate and provoke them to any seditious practices.","difficulty":91},{"originalSentence":"It is likewise profitable to direct the subjects how to act towards a prince that is inclined to bear hard upon them, so as not to alienate his affections from them, but to win upon him by humble remonstrances (not insolent demands, such as the people made upon Rehoboam), by patient submissions and peaceable expedients.","difficulty":14},{"originalSentence":"The same rule is to be observed in all relations, for the preserving of the comfort of them.","difficulty":2},{"originalSentence":"Let wisdom direct to gentle methods and forbear violent ones.","difficulty":82},{"originalSentence":"(1.","difficulty":57},{"originalSentence":") Wisdom will teach us to whet the tool we are to make use of, rather than, by leaving it blunt, oblige ourselves to exert so much the more strength, Eccl.","difficulty":72},{"originalSentence":"10:10.","difficulty":10},{"originalSentence":"We might save ourselves a great deal of labour, and prevent a great deal of danger, if we did whet before we cut, that is, consider and premeditate what is fit to be said and done in every difficult case, that we may accommodate ourselves to it and may do our work smoothly and easily both to others and to ourselves.","difficulty":12},{"originalSentence":"Wisdom will direct how to sharpen and put an edge upon both ourselves and those we employ, not to work deceitfully (Ps.","difficulty":5},{"originalSentence":"52:2), but to work cleanly and cleverly.","difficulty":4},{"originalSentence":"The mower loses no time when he is whetting his scythe.","difficulty":83},{"originalSentence":"(2.","difficulty":54},{"originalSentence":") Wisdom will teach us to enchant the serpent we are to contend with, rather than think to out-hiss it (Eccl.","difficulty":52},{"originalSentence":"10:11): The serpent will bite if he be not by singing and music charmed and enchanted, against which therefore he stops his ears (Ps.","difficulty":94},{"originalSentence":"58:4, 5); and a babbler is no better to all those who enter the lists with him, who therefore must not think by dint of words to out-talk him, but be prudent management to enchant him.","difficulty":99},{"originalSentence":"He that is lord of the tongue (so the phrase is), a ruler that has liberty of speech and may say what he will, it is as dangerous dealing with him as with a serpent uncharmed; but, if you use the enchantment of a mild and humble submission, you may be safe and out of danger; herein wisdom, the meekness of wisdom, is profitable to direct.","difficulty":76},{"originalSentence":"By long forbearing is a prince persuaded, Prov.","difficulty":20},{"originalSentence":"25:15.","difficulty":16},{"originalSentence":"Jacob enchanted Esau with a present and Abigail David.","difficulty":80},{"originalSentence":"To those that may say any thing it is wisdom to say nothing that is provoking.","difficulty":16}]