[{"originalSentence":"Two things we are apt to take a great deal of pleasure and satisfaction in, and value ourselves upon, with reference to our business and enjoyments in the world, as if they helped to save them from vanity.","difficulty":13},{"originalSentence":"Solomon shows us our mistake in both.","difficulty":48},{"originalSentence":"1.","difficulty":22},{"originalSentence":"The novelty of the invention, that it is such as was never known before.","difficulty":89},{"originalSentence":"How grateful is it to think that none ever made such advances in knowledge, and such discoveries by it, as we, that none ever made such improvements of an estate or trade, and had the art of enjoying the gains of it, as we have.","difficulty":37},{"originalSentence":"Their contrivances and compositions are all despised and run down, and we boast of new fashions, new hypotheses, new methods, new expressions, which jostle out the old, and put them down.","difficulty":43},{"originalSentence":"But this is all a mistake: The thing that is, and shall be, is the same with that which has been, and that which shall be done will be but the same with that which is done, for there is no new thing under the sun, Eccl.","difficulty":48},{"originalSentence":"1:9.","difficulty":25},{"originalSentence":"It is repeated (Eccl.","difficulty":44},{"originalSentence":"1:10) by way of question, is there any thing of which it may be said, with wonder, See, this is new; there never was the like?","difficulty":49},{"originalSentence":"It is an appeal to observing men, and a challenge to those that cry up modern learning above that of the ancients.","difficulty":9},{"originalSentence":"Let them name any thing which they take to be new, and though perhaps we cannot make it to appear, for want of the records of former times, yet we have reason to conclude that it has been already of old time, which was before us.","difficulty":19},{"originalSentence":"What is there in the kingdom of nature of which we may say, This is new?","difficulty":54},{"originalSentence":"The works were finished from the foundation of the world (Heb.","difficulty":94},{"originalSentence":"4:3); things which appear new to us, as they do to children, are not so in themselves.","difficulty":64},{"originalSentence":"The heavens were of old; the earth abides for ever; the powers of nature and the links of natural causes are still the same that ever they were.","difficulty":29},{"originalSentence":"In the kingdom of Providence, though the course and method of it have not such known and certain rules as that of nature, nor does it go always in the same track, yet, in the general, it is still the same thing over and over again.","difficulty":82},{"originalSentence":"Men’s hearts, and the corruptions of them, are still the same; their desires, and pursuits, and complaints, are still the same; and what God does in his dealings with men is according to the scripture, according to the manner, so that it is all repetition.","difficulty":65},{"originalSentence":"What is surprising to us needs not be so, for there has been the like, the like strange advancements and disappointments, the like strange revolutions and sudden turns, sudden turns of affairs; the miseries of human life have always been much the same, and mankind tread a perpetual round, and, as the sun and wind, are but where they were.","difficulty":93},{"originalSentence":"Now the design of this is, (1.","difficulty":55},{"originalSentence":") To show the folly of the children of men in affecting things that are new, in imagining that they have discovered such things, and in pleasing and priding themselves in them.","difficulty":97},{"originalSentence":"We are apt to nauseate old things, and to grow weary of what we have been long used to, as Israel of the manna, and covet, with the Athenians, still to tell and hear of some new thing, and admire this and the other as new, whereas it is all what has been.","difficulty":22},{"originalSentence":"Tatianus the Assyrian, showing the Grecians how all the arts which they valued themselves upon owed their original to those nations which they counted barbarous, thus reasons with them: “For shame, do not call those things eureseis—inventions, which are but mimeseis—imitations.","difficulty":59},{"originalSentence":"” (2.","difficulty":44},{"originalSentence":") To take us off from expecting happiness or satisfaction in the creature.","difficulty":33},{"originalSentence":"Why should we look for it there, where never any yet have found it?","difficulty":38},{"originalSentence":"What reason have we to think that the world should be any kinder to us than it has been to those that have gone before us, since there is nothing in it that is new, and our predecessors have made as much of it as could be made?","difficulty":15},{"originalSentence":"Your fathers did eat manna, and yet they are dead.","difficulty":5},{"originalSentence":"See John 8:8, 9; John 6:49.","difficulty":62},{"originalSentence":"(3.","difficulty":79},{"originalSentence":") To quicken us to secure spiritual and eternal blessings.","difficulty":63},{"originalSentence":"If we would be en 4529 tertained with new things, we must acquaint ourselves with the things of God, get a new nature; then old things pass away, and all things become new, 2 Cor.","difficulty":57},{"originalSentence":"5:17.","difficulty":12},{"originalSentence":"The gospel puts a new song into our mouths.","difficulty":7},{"originalSentence":"In heaven all is new (Rev.","difficulty":49},{"originalSentence":"21:5), all new at first, wholly unlike the present state of things, a new world indeed (Luke 20:35), and all new to eternity, always fresh, always flourishing.","difficulty":40},{"originalSentence":"This consideration should make us willing to die, That in this world there is nothing but the same over and over again, and we can expect nothing from it more or better than we have had.","difficulty":23},{"originalSentence":"2.","difficulty":48},{"originalSentence":"The memorableness of the achievement, that it is such as will be known and talked of hereafter.","difficulty":70},{"originalSentence":"Many think they have found satisfaction enough in this, that their names shall be perpetuated, that posterity will celebrate the actions they have performed, the honours they have won, and the estates they have raised, that their houses shall continue for ever (Ps.","difficulty":79},{"originalSentence":"49:11); but herein they deceive themselves.","difficulty":86},{"originalSentence":"How many former things and persons were there, which in their day looked very great and made a mighty figure, and yet there is no remembrance of them; they are buried in oblivion.","difficulty":24},{"originalSentence":"Here and there one person or action that was remarkable met with a kind historian, and had the good hap to be recorded, when at the same time there were others, no less remarkable, that were dropped: and therefore we may conclude that neither shall there be any remembrance of things to come, but that which we hope to be remembered by will be either lost or slighted.","difficulty":52}]