[{"originalSentence":"In these verses Solomon shows,\n\nI.","difficulty":14},{"originalSentence":"What great need wise men have to take heed of being guilty of any instance of folly; for a little folly is a great blemish to him that is in reputation for wisdom and honour, and is as hurtful to his good name as dead flies are to a sweet perfume, not only spoiling the sweetness of it, but making it to send forth a stinking savour.","difficulty":2},{"originalSentence":"Note, 1.","difficulty":62},{"originalSentence":"True wisdom is true honour, and will gain a man a reputation, which is like a box of precious ointment, pleasing and very valuable.","difficulty":36},{"originalSentence":"2.","difficulty":69},{"originalSentence":"The reputation that is got with difficulty, and by a great deal of wisdom, may be easily lost, and by a little folly, because envy fastens upon eminency, and makes the worst of the mistakes and miscarriages of those who are cried up for wisdom, and improves them to their disadvantage; so that the folly which in another would not be taken notice of in them is severely censured.","difficulty":22},{"originalSentence":"Those who make a great profession of religion have need to walk very circumspectly, to abstain from all appearances of evil, and approaches towards it, because many eyes are upon them, that watch for their halting; their character is soon sullied, and they have a great deal of reputation to lose.","difficulty":79},{"originalSentence":"II.","difficulty":21},{"originalSentence":"What a deal of advantage a wise man has above a fool in the management of business (Eccl.","difficulty":46},{"originalSentence":"10:2): A wise man’s heart is at his right hand, so that he goes about his business with dexterity, turns his hand readily to it, and goes through it with despatch; his counsel and courage are ready to him, whenever he has occasion for them.","difficulty":26},{"originalSentence":"But a fool’s heart is at his left hand; it is always to seek when he has any thing to do that is of importance, and therefore he goes awkwardly about it, like a man that is left-handed; he is soon at a loss and at his wits’ end.","difficulty":8},{"originalSentence":"III.","difficulty":31},{"originalSentence":"How apt fools are at every turn to proclaim their own folly, and expose themselves; he that is either witless or graceless, either silly or wicked, if he be ever so little from under the check, and left to himself, if he but walk by the way, soon shows what he is; his wisdom fails him, and, by some impropriety or other, he says to every one he meets that he is a fool (Eccl.","difficulty":77},{"originalSentence":"10:3), that is, he discovers his folly as plainly as if he had told them so.","difficulty":20},{"originalSentence":"He cannot conceal it, and he is not ashamed of it.","difficulty":81},{"originalSentence":"Sin is the reproach of sinners wherever they go.","difficulty":91}]