[{"originalSentence":"Solomon, having shown the benefit of wisdom, and of what great advantage it is to us in the management of our affairs, here shows the mischief of folly and how it exposes men, which perhaps comes in as a reflection upon those rulers who set folly in great dignity.","difficulty":6},{"originalSentence":"I.","difficulty":82},{"originalSentence":"Fools talk a great deal to no purpose, and they show their folly as much by the multitude, impertinence, and mischievousness of their words, as by any thing; whereas the words of a wise man’s mouth are gracious, are grace, manifest grace in his heart and minister grace to the hearers, are good, and such as become him, and do good to all about him, the lips of a fool not only expose him to reproach and make him ridiculous, but will swallow up himself and bring him to ruin, by provoking the government to take cognizance of his seditious talk and call him to an account for it.","difficulty":4},{"originalSentence":"Adonijah foolishly spoke against his own life, 1 Kgs.","difficulty":76},{"originalSentence":"2:23.","difficulty":11},{"originalSentence":"Many a man has been sunk by having his own tongue fall upon him, Ps.","difficulty":3},{"originalSentence":"64:8.","difficulty":70},{"originalSentence":"See what a fool’s talk is.","difficulty":91},{"originalSentence":"1.","difficulty":44},{"originalSentence":"It takes rise from his own weakness and wickedness: The beginning of the words of his mouth is foolishness, the foolishness bound up in his heart, that is the corrupt spring out of which all these polluted streams flow, the evil treasure out of which evil things are brought.","difficulty":63},{"originalSentence":"As soon as he begins to speak you may perceive his folly; at the very first he talks idly, and passionately, and like himself.","difficulty":1},{"originalSentence":"2.","difficulty":8},{"originalSentence":"It rises up to fury, and tends to the hurt and injury of others: The end of his talk, the end it comes to, is madness.","difficulty":8},{"originalSentence":"He will presently talk himself into an indecent heat, and break out into the wild extravagancies of a distracted man.","difficulty":91},{"originalSentence":"The end he aims at is mischief; as, at first, he appeared to have little government of himself, so, at last, it appears he has a great deal of malice to his neighbours; that root of bitterness bears gall and wormwood.","difficulty":31},{"originalSentence":"Note, It is not strange if those that begin foolishly end madly; for an ungoverned tongue, the more liberty is allowed, grows the more violent.","difficulty":80},{"originalSentence":"3.","difficulty":47},{"originalSentence":"It is all the same over and over (Eccl.","difficulty":41},{"originalSentence":"10:14): A fool also is full of words, a passionate fool especially, that runs on endlessly and never knows when to leave off.","difficulty":40},{"originalSentence":"He will have the last word, though it be but the same with that which was the first.","difficulty":100},{"originalSentence":"What is wanting in the weight and strength of his words he endeavours in vain to make up in the number of them; and they must be repeated, because otherwise there is nothing in them to make them regarded.","difficulty":54},{"originalSentence":"Note, Many who are empty of sense are full of words; and the least solid are the most noisy.","difficulty":79},{"originalSentence":"The following words may be taken either, (1.","difficulty":96},{"originalSentence":") As checking him for his vainglorious boasting in the multitude of his words, what he will do and what he will have, not considering that which every body knows that a man cannot tell what shall be in his own time, while he lives (Prov.","difficulty":28},{"originalSentence":"27:1), much less can one tell what shall be after him, when he is dead and gone.","difficulty":6},{"originalSentence":"Would we duly consider our own ignorance of, and uncertainty about, future events, it would cut off a great many of the idle words we foolishly multiply.","difficulty":90},{"originalSentence":"Or, (2.","difficulty":48},{"originalSentence":") As mocking him for his tautologies.","difficulty":25},{"originalSentence":"He is full of words, for if he do but speak the most trite and common thing, a man cannot tell what shall be, because he loves to hear himself talk, he will say it again, what shall be after him who can tell him?","difficulty":33},{"originalSentence":"like Battus in Ovid:\n\n----Sub illis Montibus (inquit) erant, et erant sub montibus illis—Under those mountains were they, They were under those mountains, I say—whence vain repetitions are called Battologies, Matt.","difficulty":0},{"originalSentence":"6:7.","difficulty":45},{"originalSentence":"II.","difficulty":59},{"originalSentence":"Fools toil a great deal to no purpose (Eccl.","difficulty":15},{"originalSentence":"10:15); The labour of the foolish, to accomplish their designs, wearies every one of them.","difficulty":82},{"originalSentence":"1.","difficulty":3},{"originalSentence":"They weary themselves in that labour which is very foolish and absurd.","difficulty":60},{"originalSentence":"All their labour is for the world and the body, and the meat that perishes, and in this labour they spend their strength, and exhaust their spirits, and weary themselves for very vanity, Hab.","difficulty":41},{"originalSentence":"2:13; Isa.","difficulty":73},{"originalSentence":"55:2.","difficulty":96},{"originalSentence":"They choose that service which is perfect drudgery rather than that which is perfect liberty.","difficulty":40},{"originalSentence":"2.","difficulty":9},{"originalSentence":"That labour which is necessary, and would be profitable, and might be gone through with ease, wearies them, because they go about it awkwardly and foolishly, and so make their business a toil to them, which, if they applied themselves to it prudently, would be a pleasure to them.","difficulty":15},{"originalSentence":"Many complain of the labours of religion as grievous, which they would have no reason to complain of if the exercises of Christian piety were always under the direction of Christian prudence.","difficulty":83},{"originalSentence":"The foolish tire themselves in endless pursuits, and never bring any thing to pass, because they know not how to go to the city, that is, because they have not capacity to apprehend the plainest thing, such as the entrance into a great city is, where one would think it were impossible for a man to miss his road.","difficulty":63},{"originalSentence":"Men’s imprudent management of their business robs them both of the comfort and of the benefit of it.","difficulty":0},{"originalSentence":"But it is the excellency of the way to the heavenly city that it is a high-way, in which the wayfaring men, though fools, shall not err (Isa.","difficulty":67},{"originalSentence":"35:8); yet sinful folly makes men miss that way.","difficulty":0}]