[{"originalSentence":"Solomon here observes,\n\nI.","difficulty":95},{"originalSentence":"How much the happiness of a land depends upon the character of its rulers; it is well or ill with the people according as the princes are good or bad.","difficulty":51},{"originalSentence":"1.","difficulty":62},{"originalSentence":"The people cannot be happy when their princes are childish and voluptuous (Eccl.","difficulty":30},{"originalSentence":"10:16): Woe unto thee, O land!","difficulty":36},{"originalSentence":"even the land of Canaan itself, though otherwise the glory of all lands, when thy king is a child, not so much in age (Solomon himself was young when his kingdom was happy in him) as in understanding; when the prince is weak and foolish as a child, fickle and fond of changes, fretful and humoursome, easily imposed upon, and hardly brought to business, it is ill with the people.","difficulty":16},{"originalSentence":"The body staggers if the head be giddy.","difficulty":65},{"originalSentence":"Perhaps Solomon wrote this with a foresight of his son Rehoboam’s ill conduct (2 Chron.","difficulty":13},{"originalSentence":"13:7); he was a child all the days of his life and his family and kingdom fared the worse for it.","difficulty":40},{"originalSentence":"Nor is it much better with a people when their princes eat in the morning, that is, make a god of their belly and make themselves slaves to their appetites.","difficulty":50},{"originalSentence":"If the king himself be a child, yet if the princes and privy-counsellors are wise and faithful, and apply themselves to business, the land may do the better; but if they addict themselves to their pleasures, and prefer the gratifications of the flesh before the despatch of the public business, which they disfit themselves for by eating and drinking in a morning, when judges are epicures, and do not eat to live, but live to eat, what good can a nation expect!","difficulty":9},{"originalSentence":"2.","difficulty":92},{"originalSentence":"The people cannot but be happy when their rulers are generous and active, sober and temperate, and men of business, Eccl.","difficulty":4},{"originalSentence":"10:17.","difficulty":76},{"originalSentence":"The land is then blessed, (1.","difficulty":31},{"originalSentence":") When the sovereign is governed by principles of honour, when the king is the son of nobles, actuated and animated by a noble spirit, which scorns to do any thing base and unbecoming so high a character, which is solicitous for the public welfare, and prefers that before any private interests.","difficulty":42},{"originalSentence":"Wisdom, virtue, and the fear of God, beneficence, and a readiness to do good to all mankind, these ennoble the royal blood.","difficulty":23},{"originalSentence":"2.","difficulty":14},{"originalSentence":"When the subordinate magistrates are more in care to discharge their trusts than to gratify their appetites; when they eat in due season (Ps.","difficulty":70},{"originalSentence":"145:15); let us not take ours unseasonable, lest we lose the comfort of seeing God give it to us.","difficulty":85},{"originalSentence":"Magistrates should eat for strength, that their bodies may be fitted to serve their souls in the service of God and their country, and not for drunkenness, to make themselves unfit to do any thing either for God or man, and particularly to sit in judgment, for they will err through wine (Isa.","difficulty":78},{"originalSentence":"28:7), will drink and forget the law, Prov.","difficulty":0},{"originalSentence":"31:5.","difficulty":69},{"originalSentence":"It is well with a people when their princes are examples of temperance, when those that have most to spend upon themselves know how to deny themselves.","difficulty":94},{"originalSentence":"II.","difficulty":48},{"originalSentence":"Of what ill consequence slothfulness is both to private and public affairs (Eccl.","difficulty":13},{"originalSentence":"10:18): By much slothfulness and idleness of the hands, the neglect of business, and the love of ease and pleasure, the building decays, drops through first, and by degrees drops down.","difficulty":82},{"originalSentence":"If it be not kept well covered, and care be not taken to repair the breaches, as any happen, it will rain in, and the timber will rot, and the house will become unfit to dwell in.","difficulty":44},{"originalSentence":"It is so with the family and the affairs of it; if men cannot find in their hearts to take pains in their callings, to tend their shops and look after their own business, they will soon run in debt and go behind-hand, and, instead of making what they have more for their children, will make it less.","difficulty":36},{"originalSentence":"It is so with the public; if the king be a child and will take no care, if the princes eat in the morning and will take no pains, the affairs of the nation suffer loss, and its interests are prejudiced, its honour is sullied, its power is weakened, its borders are encroached upon, the course of justice is obstructed, the treasure is exhausted, and all its foundations are out of course, and all this through the slothfulness of self-seeking of those that should be the repairers of its breaches and the restorers of paths to dwell in, Isa.","difficulty":99},{"originalSentence":"58:12.","difficulty":53},{"originalSentence":"III.","difficulty":28},{"originalSentence":"How industrious generally all are, both princes and people, to get money, because that serves for all purposes, Eccl.","difficulty":5},{"originalSentence":"10:19.","difficulty":24},{"originalSentence":"He seems to prefer money before mirth: A feast is made for laughter, not merely for eating, but chiefly for pleasant conversation and the society of friends, not the laughter of the fool, which is madness, but that of wise men, by which they fit themselves for business and severe studies.","difficulty":15},{"originalSentence":"Spiritual feasts are made for spiritual laughter, holy joy in God.","difficulty":23},{"originalSentence":"Wine makes merry, makes glad the life, but money is the measure of all things and answers all things.","difficulty":20},{"originalSentence":"Pecuniae obediunt omnia- e8f -Money commands all things.","difficulty":98},{"originalSentence":"Though wine make merry, it will not be a house for us, nor a bed, nor clothing, nor provisions and portions for children; but money, if men have enough of it, will be all these.","difficulty":23},{"originalSentence":"The feast cannot be made without money, and, though men have wine, they are not so much disposed to be merry unless they have money for the necessary supports of life.","difficulty":10},{"originalSentence":"Money of itself answers nothing; it will neither feed nor clothe; but, as it is the instrument of commerce, it answers all the occasions of this present life.","difficulty":22},{"originalSentence":"What is to be had may be had for money.","difficulty":18},{"originalSentence":"But it answers nothing to the soul; it will not procure the pardon of sin, the favour of God, the peace of conscience; the soul, as it is not redeemed, so it is not maintained, with corruptible things as silver and gold.","difficulty":44},{"originalSentence":"Some refer this to rulers; it is ill with the people when they give up themselves to luxury and riot, feasting and making merry, not only because their business is neglected, but because money must be had to answer all these things, and, in order to that, the people squeezed by heavy taxes.","difficulty":39},{"originalSentence":"IV.","difficulty":91},{"originalSentence":"How cautious subjects have need to be that they harbour not any disloyal purposes in their minds, nor keep up any factious cabals or consultations against the government, because it is ten to one that they are discovered and brought to light, Eccl.","difficulty":32},{"originalSentence":"10:20.","difficulty":71},{"originalSentence":"“Though rulers should be guilty of some errors, yet be not, upon all occasions, arraigning their administration and running them down, but make the best of them.","difficulty":91},{"originalSentence":"” Here, 1.","difficulty":64},{"originalSentence":"The command teaches us our duty “Curse not the king, no, not in thy thought, do not wish ill to the government in thy mind.","difficulty":22},{"originalSentence":"” All sin begins there, and therefore the first risings of it must be curbed and suppressed, and particularly that of treason and sedition.","difficulty":43},{"originalSentence":"“Curse not the rich, the princes and governors, in thy bed-chamber, in a conclave or club of persons disaffected to the government; associate not with such; come not into their secret; join not with them in speaking ill of the government or plotting against it.","difficulty":74},{"originalSentence":"” 2.","difficulty":84},{"originalSentence":"The reason consults our safety.","difficulty":13},{"originalSentence":"“Though the design be carried on ever so closely, a bird of the air shall carry the voice to the king, who has more spies about than thou art aware of, and that which has wings shall tell the matter, to thy confusion and ruin.","difficulty":63},{"originalSentence":"” God sees what men do, and hears what they say, in secret; and, when he pleases, he can bring it to light by strange and unsuspected ways.","difficulty":80},{"originalSentence":"Wouldst thou then not be hurt by the powers that be, nor be afraid of them?","difficulty":45},{"originalSentence":"Do that which is good and thou shalt have praise of the same; but, if thou do that which is evil, be afraid, Rom.","difficulty":75},{"originalSentence":"13:3, 4.","difficulty":23}]