[{"originalSentence":"The preacher here, for a further proof of the vanity of the world, and to convince us that all our works are in the hand of God, and not in our 4563 own hand, shows the uncertainty and contingency of future events, and how often they contradict the prospects we have of them.","difficulty":0},{"originalSentence":"He had exhorted us (Eccl.","difficulty":18},{"originalSentence":"9:10) to do what we have to do with all our might; but here he reminds us that, when we have done all, we must leave the issue with God, and not be confident of the success.","difficulty":0},{"originalSentence":"I.","difficulty":14},{"originalSentence":"We are often disappointed of the good we had great hopes of, Eccl.","difficulty":24},{"originalSentence":"9:11.","difficulty":14},{"originalSentence":"Solomon had himself made the observation, and so has many a one since, that events, both in public and private affairs, do not always agree even with the most rational prospects and probabilities.","difficulty":10},{"originalSentence":"Nulli fortuna tam dedita est ut multa tentanti ubique respondeat—Fortune surrenders herself to no one so as to ensure him success, however numerous his undertakings.","difficulty":12},{"originalSentence":"Seneca.","difficulty":3},{"originalSentence":"The issue of affairs is often unaccountably cross to every one’s expectation, that the highest may not presume, nor the lowest despair, but all may live in a humble dependence upon God, from whom every man’s judgment proceeds.","difficulty":100},{"originalSentence":"1.","difficulty":98},{"originalSentence":"He gives instances of disappointment, even where means and instruments were most encouraging and promised fair.","difficulty":21},{"originalSentence":"(1.","difficulty":29},{"originalSentence":") One would think that the lightest of foot should, in running, win the prize; and yet the race is not always to the swift; some accident happens to retard them, or they are too secure, and therefore remiss, and let those that are slower get the start of them.","difficulty":45},{"originalSentence":"(2.","difficulty":34},{"originalSentence":") One would think that, in fighting, the most numerous and powerful army should be always victorious, and, in single combat, that the bold and mighty champion should win the laurel; but the battle is not always to the strong; a host of Philistines was once put to flight by Jonathan and his man; one of you shall chase a thousand; the goodness of the cause has often carried the day against the most formidable power.","difficulty":57},{"originalSentence":"(3.","difficulty":73},{"originalSentence":") One would think that men of sense should always be men of substance, and that those who know how to live in the world should not only have a plentiful maintenance, but get great estates; and yet it does not always prove so; even bread is not always to the wise, much less riches always to men of understanding.","difficulty":25},{"originalSentence":"Many ingenious men, and men of business, who were likely to thrive in the world, have strangely gone backward and come to nothing.","difficulty":30},{"originalSentence":"(4.","difficulty":84},{"originalSentence":") One would think that those who understand men, and have the art of management, should always get preferment and obtain the smiles of great men; but many ingenious men have been disappointed, and have spent their days in obscurity, nay, have fallen into disgrace, and perhaps have ruined themselves by those very methods by which they hoped to raise themselves, for favour is not always to men of skill, but fools are favoured and wise men frowned upon.","difficulty":95},{"originalSentence":"2.","difficulty":87},{"originalSentence":"He resolves all these disappointments into an over-ruling power and providence, the disposals of which to us seem casual, and we call them chance, but really they are according to the determinate counsel and foreknowledge of God, here called time, in the language of this book, Eccl.","difficulty":70},{"originalSentence":"3:1; Ps.","difficulty":6},{"originalSentence":"31:15.","difficulty":100},{"originalSentence":"Time and chance happen to them all.","difficulty":19},{"originalSentence":"A sovereign Providence breaks men’s measures, and blasts their hopes, and teaches them that the way of man is not in himself, but subject to the divine will.","difficulty":26},{"originalSentence":"We must use means, but not trust to them; if we succeed, we must give God the praise (Ps.","difficulty":89},{"originalSentence":"44:3); if we be crossed, we must acquiesce in his will and take our lot.","difficulty":68},{"originalSentence":"II.","difficulty":69},{"originalSentence":"We are often surprised with the evils we were in little fear of (Eccl.","difficulty":23},{"originalSentence":"9:12): Man knows not his time, the time of his calamity, his fall, his death, which, in scripture, is called our day and our hour.","difficulty":92},{"originalSentence":"1.","difficulty":2},{"originalSentence":"We know not what troubles are before us, which will take us off our business, and take us out of the world, what time and chance will happen to us, nor what one day, or a night, may bring forth.","difficulty":99},{"originalSentence":"It is not for us to know the times, no, not our own time, when or how we shall die.","difficulty":4},{"originalSentence":"God has, in wisdom, kept us in the dark, that we may be always ready.","difficulty":57},{"originalSentence":"2.","difficulty":40},{"originalSentence":"Perhaps we may meet with trouble in that very thing wherein we promise ourselves the greatest satisfaction and advantage; as the fishes and the birds are drawn into the snare and net by the bait laid to allure them, which they greedily catch at, so are the sons of men often snared in an evil time, when it falls suddenly upon them, before they are aware.","difficulty":35},{"originalSentence":"And these things too come alike to all.","difficulty":99},{"originalSentence":"Men often find their bane where they sought their bless, and catch their death where they thought to find a prize.","difficulty":20},{"originalSentence":"Let us therefore never be secure, but always ready for changes, that, though they may be sudden, they may be no surprise or terror to us.","difficulty":67}]
